; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite4 - satellite
	instrument12 - instrument
	thermograph7 - mode
	image0 - mode
	spectrograph1 - mode
	infrared3 - mode
	image4 - mode
	thermograph5 - mode
	thermograph6 - mode
	spectrograph2 - mode
	star1 - direction
	star11 - direction
	star5 - direction
	groundstation4 - direction
	groundstation8 - direction
	star9 - direction
	groundstation3 - direction
	star12 - direction
	groundstation2 - direction
	star6 - direction
	star13 - direction
	groundstation14 - direction
	star7 - direction
	groundstation10 - direction
	star0 - direction
	planet15 - direction
	star16 - direction
	star17 - direction
	phenomenon18 - direction
	planet19 - direction
	star20 - direction
	planet21 - direction
	phenomenon22 - direction
	planet23 - direction
	planet24 - direction
	phenomenon25 - direction
	planet26 - direction
	planet27 - direction
	star28 - direction
	star29 - direction
	star30 - direction
	star31 - direction
	star32 - direction
	planet33 - direction
	star34 - direction
	star35 - direction
	star36 - direction
	phenomenon37 - direction
	planet38 - direction
	star39 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 groundstation2)
	(calibration_target instrument0 star13)
	(calibration_target instrument0 groundstation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 phenomenon37)
	(supports instrument1 thermograph7)
	(supports instrument1 infrared3)
	(calibration_target instrument1 groundstation10)
	(calibration_target instrument1 star6)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 groundstation14)
	(supports instrument2 thermograph7)
	(calibration_target instrument2 star9)
	(calibration_target instrument2 groundstation2)
	(calibration_target instrument2 star1)
	(calibration_target instrument2 groundstation4)
	(calibration_target instrument2 groundstation10)
	(supports instrument3 thermograph7)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 star12)
	(supports instrument4 spectrograph1)
	(supports instrument4 spectrograph2)
	(supports instrument4 image4)
	(calibration_target instrument4 star0)
	(calibration_target instrument4 groundstation8)
	(calibration_target instrument4 star7)
	(calibration_target instrument4 star5)
	(supports instrument5 image4)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 star7)
	(calibration_target instrument5 star5)
	(calibration_target instrument5 star6)
	(calibration_target instrument5 star11)
	(supports instrument6 image0)
	(supports instrument6 infrared3)
	(calibration_target instrument6 groundstation8)
	(calibration_target instrument6 star6)
	(calibration_target instrument6 groundstation4)
	(calibration_target instrument6 groundstation10)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 planet21)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 star6)
	(calibration_target instrument7 star9)
	(supports instrument8 image0)
	(supports instrument8 infrared3)
	(calibration_target instrument8 groundstation3)
	(supports instrument9 spectrograph1)
	(supports instrument9 infrared3)
	(calibration_target instrument9 star12)
	(supports instrument10 infrared3)
	(calibration_target instrument10 groundstation2)
	(calibration_target instrument10 groundstation10)
	(calibration_target instrument10 star12)
	(supports instrument11 thermograph6)
	(supports instrument11 thermograph5)
	(supports instrument11 image4)
	(calibration_target instrument11 star7)
	(calibration_target instrument11 groundstation14)
	(calibration_target instrument11 star13)
	(calibration_target instrument11 star6)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(power_avail satellite3)
	(pointing satellite3 star16)
	(supports instrument12 spectrograph2)
	(calibration_target instrument12 star0)
	(calibration_target instrument12 groundstation10)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 planet26)
)
(:goal (and
	(have_image planet15 thermograph5)
	(have_image planet15 image4)
	(have_image star16 spectrograph1)
	(have_image star17 spectrograph2)
	(have_image phenomenon18 image0)
	(have_image planet19 image4)
	(have_image planet19 image0)
	(have_image star20 spectrograph2)
	(have_image planet21 image0)
	(have_image planet21 thermograph6)
	(have_image phenomenon22 spectrograph1)
	(have_image planet23 image4)
	(have_image planet23 thermograph5)
	(have_image planet24 infrared3)
	(have_image planet24 thermograph5)
	(have_image phenomenon25 spectrograph2)
	(have_image phenomenon25 thermograph6)
	(have_image planet26 thermograph7)
	(have_image planet26 image4)
	(have_image star29 thermograph7)
	(have_image star29 spectrograph1)
	(have_image star30 spectrograph1)
	(have_image star31 thermograph6)
	(have_image star31 thermograph7)
	(have_image star32 image4)
	(have_image planet33 infrared3)
	(have_image planet33 thermograph6)
	(have_image star35 thermograph6)
	(have_image star35 spectrograph2)
	(have_image phenomenon37 spectrograph2)
	(have_image planet38 infrared3)
	(have_image star39 spectrograph2)
))
(:metric minimize (total-time))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 32
2. (turn_to satellite0 phenomenon18 phenomenon37)
   deleted: (pointing satellite0 phenomenon37)
   added: (pointing satellite0 phenomenon18)
   goals met: 0 of 32
3. (turn_to satellite0 star13 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 star13)
   goals met: 0 of 32
4. (calibrate satellite0 instrument0 star13)
   added: (calibrated instrument0)
   goals met: 0 of 32
5. (turn_to satellite0 phenomenon18 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 phenomenon18)
   goals met: 0 of 32
6. (take_image satellite0 phenomenon18 instrument0 image0)
   added: (have_image phenomenon18 image0)
   goals met: 1 of 32
7. (turn_to satellite2 phenomenon22 planet21)
   deleted: (pointing satellite2 planet21)
   added: (pointing satellite2 phenomenon22)
   goals met: 1 of 32
8. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 32
9. (turn_to satellite2 groundstation8 phenomenon22)
   deleted: (pointing satellite2 phenomenon22)
   added: (pointing satellite2 groundstation8)
   goals met: 1 of 32
10. (calibrate satellite2 instrument4 groundstation8)
   added: (calibrated instrument4)
   goals met: 1 of 32
11. (turn_to satellite2 phenomenon22 groundstation8)
   deleted: (pointing satellite2 groundstation8)
   added: (pointing satellite2 phenomenon22)
   goals met: 1 of 32
12. (take_image satellite2 phenomenon22 instrument4 spectrograph1)
   added: (have_image phenomenon22 spectrograph1)
   goals met: 2 of 32
13. (turn_to satellite2 phenomenon25 phenomenon22)
   deleted: (pointing satellite2 phenomenon22)
   added: (pointing satellite2 phenomenon25)
   goals met: 2 of 32
14. (take_image satellite2 phenomenon25 instrument4 spectrograph2)
   added: (have_image phenomenon25 spectrograph2)
   goals met: 3 of 32
15. (switch_on instrument11 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument11)
   goals met: 3 of 32
16. (turn_to satellite3 phenomenon25 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 phenomenon25)
   goals met: 3 of 32
17. (turn_to satellite3 star7 phenomenon25)
   deleted: (pointing satellite3 phenomenon25)
   added: (pointing satellite3 star7)
   goals met: 3 of 32
18. (calibrate satellite3 instrument11 star7)
   added: (calibrated instrument11)
   goals met: 3 of 32
19. (turn_to satellite3 phenomenon25 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 phenomenon25)
   goals met: 3 of 32
20. (take_image satellite3 phenomenon25 instrument11 thermograph6)
   added: (have_image phenomenon25 thermograph6)
   goals met: 4 of 32
21. (turn_to satellite2 phenomenon37 phenomenon25)
   deleted: (pointing satellite2 phenomenon25)
   added: (pointing satellite2 phenomenon37)
   goals met: 4 of 32
22. (take_image satellite2 phenomenon37 instrument4 spectrograph2)
   added: (have_image phenomenon37 spectrograph2)
   goals met: 5 of 32
23. (turn_to satellite2 planet15 phenomenon37)
   deleted: (pointing satellite2 phenomenon37)
   added: (pointing satellite2 planet15)
   goals met: 5 of 32
24. (take_image satellite2 planet15 instrument4 image4)
   added: (have_image planet15 image4)
   goals met: 6 of 32
25. (turn_to satellite3 planet15 phenomenon25)
   deleted: (pointing satellite3 phenomenon25)
   added: (pointing satellite3 planet15)
   goals met: 6 of 32
26. (take_image satellite3 planet15 instrument11 thermograph5)
   added: (have_image planet15 thermograph5)
   goals met: 7 of 32
27. (turn_to satellite0 planet19 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 planet19)
   goals met: 7 of 32
28. (take_image satellite0 planet19 instrument0 image0)
   added: (have_image planet19 image0)
   goals met: 8 of 32
29. (turn_to satellite2 planet19 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet19)
   goals met: 8 of 32
30. (take_image satellite2 planet19 instrument4 image4)
   added: (have_image planet19 image4)
   goals met: 9 of 32
31. (turn_to satellite0 planet21 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 planet21)
   goals met: 9 of 32
32. (take_image satellite0 planet21 instrument0 image0)
   added: (have_image planet21 image0)
   goals met: 10 of 32
33. (turn_to satellite3 planet21 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 planet21)
   goals met: 10 of 32
34. (take_image satellite3 planet21 instrument11 thermograph6)
   added: (have_image planet21 thermograph6)
   goals met: 11 of 32
35. (turn_to satellite2 planet23 planet19)
   deleted: (pointing satellite2 planet19)
   added: (pointing satellite2 planet23)
   goals met: 11 of 32
36. (take_image satellite2 planet23 instrument4 image4)
   added: (have_image planet23 image4)
   goals met: 12 of 32
37. (turn_to satellite3 planet23 planet21)
   deleted: (pointing satellite3 planet21)
   added: (pointing satellite3 planet23)
   goals met: 12 of 32
38. (take_image satellite3 planet23 instrument11 thermograph5)
   added: (have_image planet23 thermograph5)
   goals met: 13 of 32
39. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 13 of 32
40. (turn_to satellite1 groundstation10 groundstation14)
   deleted: (pointing satellite1 groundstation14)
   added: (pointing satellite1 groundstation10)
   goals met: 13 of 32
41. (calibrate satellite1 instrument1 groundstation10)
   added: (calibrated instrument1)
   goals met: 13 of 32
42. (turn_to satellite1 planet24 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 planet24)
   goals met: 13 of 32
43. (take_image satellite1 planet24 instrument1 infrared3)
   added: (have_image planet24 infrared3)
   goals met: 14 of 32
44. (turn_to satellite3 planet24 planet23)
   deleted: (pointing satellite3 planet23)
   added: (pointing satellite3 planet24)
   goals met: 14 of 32
45. (take_image satellite3 planet24 instrument11 thermograph5)
   added: (have_image planet24 thermograph5)
   goals met: 15 of 32
46. (turn_to satellite2 planet26 planet23)
   deleted: (pointing satellite2 planet23)
   added: (pointing satellite2 planet26)
   goals met: 15 of 32
47. (take_image satellite2 planet26 instrument4 image4)
   added: (have_image planet26 image4)
   goals met: 16 of 32
48. (turn_to satellite1 planet26 planet24)
   deleted: (pointing satellite1 planet24)
   added: (pointing satellite1 planet26)
   goals met: 16 of 32
49. (take_image satellite1 planet26 instrument1 thermograph7)
   added: (have_image planet26 thermograph7)
   goals met: 17 of 32
50. (turn_to satellite1 planet33 planet26)
   deleted: (pointing satellite1 planet26)
   added: (pointing satellite1 planet33)
   goals met: 17 of 32
51. (take_image satellite1 planet33 instrument1 infrared3)
   added: (have_image planet33 infrared3)
   goals met: 18 of 32
52. (turn_to satellite3 planet33 planet24)
   deleted: (pointing satellite3 planet24)
   added: (pointing satellite3 planet33)
   goals met: 18 of 32
53. (take_image satellite3 planet33 instrument11 thermograph6)
   added: (have_image planet33 thermograph6)
   goals met: 19 of 32
54. (turn_to satellite1 planet38 planet33)
   deleted: (pointing satellite1 planet33)
   added: (pointing satellite1 planet38)
   goals met: 19 of 32
55. (take_image satellite1 planet38 instrument1 infrared3)
   added: (have_image planet38 infrared3)
   goals met: 20 of 32
56. (turn_to satellite2 star16 planet26)
   deleted: (pointing satellite2 planet26)
   added: (pointing satellite2 star16)
   goals met: 20 of 32
57. (take_image satellite2 star16 instrument4 spectrograph1)
   added: (have_image star16 spectrograph1)
   goals met: 21 of 32
58. (turn_to satellite2 star17 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 star17)
   goals met: 21 of 32
59. (take_image satellite2 star17 instrument4 spectrograph2)
   added: (have_image star17 spectrograph2)
   goals met: 22 of 32
60. (turn_to satellite2 star20 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 star20)
   goals met: 22 of 32
61. (take_image satellite2 star20 instrument4 spectrograph2)
   added: (have_image star20 spectrograph2)
   goals met: 23 of 32
62. (turn_to satellite2 star29 star20)
   deleted: (pointing satellite2 star20)
   added: (pointing satellite2 star29)
   goals met: 23 of 32
63. (take_image satellite2 star29 instrument4 spectrograph1)
   added: (have_image star29 spectrograph1)
   goals met: 24 of 32
64. (turn_to satellite1 star29 planet38)
   deleted: (pointing satellite1 planet38)
   added: (pointing satellite1 star29)
   goals met: 24 of 32
65. (take_image satellite1 star29 instrument1 thermograph7)
   added: (have_image star29 thermograph7)
   goals met: 25 of 32
66. (turn_to satellite2 star30 star29)
   deleted: (pointing satellite2 star29)
   added: (pointing satellite2 star30)
   goals met: 25 of 32
67. (take_image satellite2 star30 instrument4 spectrograph1)
   added: (have_image star30 spectrograph1)
   goals met: 26 of 32
68. (turn_to satellite3 star31 planet33)
   deleted: (pointing satellite3 planet33)
   added: (pointing satellite3 star31)
   goals met: 26 of 32
69. (take_image satellite3 star31 instrument11 thermograph6)
   added: (have_image star31 thermograph6)
   goals met: 27 of 32
70. (turn_to satellite1 star31 star29)
   deleted: (pointing satellite1 star29)
   added: (pointing satellite1 star31)
   goals met: 27 of 32
71. (take_image satellite1 star31 instrument1 thermograph7)
   added: (have_image star31 thermograph7)
   goals met: 28 of 32
72. (turn_to satellite2 star32 star30)
   deleted: (pointing satellite2 star30)
   added: (pointing satellite2 star32)
   goals met: 28 of 32
73. (take_image satellite2 star32 instrument4 image4)
   added: (have_image star32 image4)
   goals met: 29 of 32
74. (turn_to satellite2 star35 star32)
   deleted: (pointing satellite2 star32)
   added: (pointing satellite2 star35)
   goals met: 29 of 32
75. (take_image satellite2 star35 instrument4 spectrograph2)
   added: (have_image star35 spectrograph2)
   goals met: 30 of 32
76. (turn_to satellite3 star35 star31)
   deleted: (pointing satellite3 star31)
   added: (pointing satellite3 star35)
   goals met: 30 of 32
77. (take_image satellite3 star35 instrument11 thermograph6)
   added: (have_image star35 thermograph6)
   goals met: 31 of 32
78. (turn_to satellite2 star39 star35)
   deleted: (pointing satellite2 star35)
   added: (pointing satellite2 star39)
   goals met: 31 of 32
79. (take_image satellite2 star39 instrument4 spectrograph2)
   added: (have_image star39 spectrograph2)
   goals met: 32 of 32
